const fs = require("fs");
const DB = require('../../MySQL/modules/db');
const logs = require('../../MySQL/modules/logs');

/*
!!types

0 - hotdog
1 - burgers
2 - clothes shop
3 - weapon
4 - tatu
5 - heardress
6 - masks shop
7 - standart shop
*/


var businesses = [
  {
    "name": "Хотдоги 1",
    "category": 0,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1249.16614,
    "y": -1474.50293,
    "z": 4.28249,
    "heading": -54.71,
    "x2": -1247.4342,
    "y2": -1473.27087,
    "z2": 4.25938
  },
  {
    "name": "Хотдоги 2",
    "category": 0,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1219.79272,
    "y": -1504.12903,
    "z": 4.36026,
    "heading": 102.88,
    "x2": -1222.46777,
    "y2": -1504.50122,
    "z2": 4.3433
  },
  {
    "name": "Бургеры 1",
    "category": 1,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1232.56921,
    "y": -1484.7749,
    "z": 4.36259,
    "heading": 143.18,
    "x2": -1234.22229,
    "y2": -1486.90161,
    "z2": 4.36091
  },
  {
    "name": "Бургеры 2",
    "category": 1,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1268.14441,
    "y": -1432.83618,
    "z": 4.35358,
    "heading": 145.44,
    "x2": -1269.63525,
    "y2": -1434.97742,
    "z2": 4.38008
  },
  {
    "name": "Тату салон на пляже",
    "category": 4,
    "price": 95000,
    "id": "u_m_y_tattoo_01",
    "x": -1152.04968,
    "y": -1426.02087,
    "z": 4.95446,
    "heading": 78.87,
    "x2": -1153.57373,
    "y2": -1425.76514,
    "z2": 4.95446
  },
  {
    "name": "Хотдоги 3",
    "category": 0,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1516.47717,
    "y": -952.38409,
    "z": 9.29763,
    "heading": -41.23,
    "x2": -1514.68127,
    "y2": -950.4112,
    "z2": 9.32349
  },
  {
    "name": "Suburban 1",
    "category": 2,
    "subcategoty": 0,
    "price": 100000,
    "id": "a_f_y_hipster_02",
    "x": -1195.05542,
    "y": -767.04218,
    "z": 17.31506,
    "heading": -143.26,
    "x2": -1193.41724,
    "y2": -768.80627,
    "z2": 17.31942
  },
  {
    "name": "Бургеры 3",
    "category": 1,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1693.49597,
    "y": -1072.94446,
    "z": 13.01737,
    "heading": 49.38,
    "x2": -1695.55371,
    "y2": -1071.37134,
    "z2": 13.11502
  },
  {
    "name": "Хотдоги 4",
    "category": 0,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1719.91235,
    "y": -1104.21362,
    "z": 13.04772,
    "heading": 39.47,
    "x2": -1721.3092,
    "y2": -1102.09436,
    "z2": 13.06761
  },
  {
    "name": "Хотдоги 5",
    "category": 0,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1771.70703,
    "y": -1160.89783,
    "z": 13.01806,
    "heading": 52.78,
    "x2": -1773.28711,
    "y2": -1159.32104,
    "z2": 13.01808
  },
  {
    "name": "Бургеры 4",
    "category": 1,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1784.51013,
    "y": -1175.92566,
    "z": 13.01773,
    "heading": 50.97,
    "x2": -1786.37622,
    "y2": -1174.34741,
    "z2": 13.01767
  },
  {
    "name": "Бургеры 5",
    "category": 1,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1856.8009,
    "y": -1224.68335,
    "z": 13.01721,
    "heading": -41.67,
    "x2": -1855.16785,
    "y2": -1222.85632,
    "z2": 13.01723
  },
  {
    "name": "Хотдоги 6",
    "category": 0,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1835.07764,
    "y": -1234.1333,
    "z": 13.01729,
    "heading": 35.13,
    "x2": -1836.27991,
    "y2": -1232.21985,
    "z2": 13.01729
  },
  {
    "name": "Бургеры 6",
    "category": 1,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1691.9884,
    "y": -1136.21008,
    "z": 13.15082,
    "heading": -1.78,
    "x2": -1692.43408,
    "y2": -1133.88831,
    "z2": 13.15243
  },
  {
    "name": "Хотдоги 7",
    "category": 0,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1682.77808,
    "y": -1124.02332,
    "z": 13.15217,
    "heading": 111.39,
    "x2": -1685.27405,
    "y2": -1124.78918,
    "z2": 13.15216
  },
  {
    "name": "Хотдоги 8",
    "category": 0,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1630.19141,
    "y": -1075.53955,
    "z": 13.06845,
    "heading": -178.15,
    "x2": -1630.4574,
    "y2": -1077.97107,
    "z2": 13.05102
  },
  {
    "name": "Хотдоги 9",
    "category": 0,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": -1638.4259,
    "y": -1082.85083,
    "z": 13.08203,
    "heading": -126.72,
    "x2": -1636.44739,
    "y2": -1084.68494,
    "z2": 13.05386
  },
  {
    "name": "Ponsonbys на кугар-авеню",
    "category": 2,
    "subcategoty": 1,
    "price": 150000,
    "id": "a_f_y_business_01",
    "x": -1448.69458,
    "y": -237.99338,
    "z": 49.79501,
    "heading": 60.55,
    "x2": -1450.75183,
    "y2": -237.25414,
    "z2": 49.80973
  },
  {
    "name": "Binco на паломино-авеню",
    "category": 2,
    "subcategoty": 2,
    "price": 75000,
    "id": "a_f_y_hipster_02",
    "x": -823.09711,
    "y": -1072.06262,
    "z": 11.32757,
    "heading": -147.61,
    "x2": -822.01733,
    "y2": -1073.82581,
    "z2": 11.3281
  },
  {
    "name": "Bob mulet",
    "category": 5,
    "price": 150000,
    "id": "s_m_m_hairdress_01",
    "x": -813.16003,
    "y": -183.00603,
    "z": 37.56892,
    "heading": 93.38,
    "x2": -815.06311,
    "y2": -183.45712,
    "z2": 37.56892
  },
  {
    "name": "Ponsonbys на портола-драйв",
    "category": 2,
    "subcategoty": 1,
    "price": 150000,
    "id": "a_f_y_business_01",
    "x": -708.77704,
    "y": -151.5807,
    "z": 37.41508,
    "heading": 120.77,
    "x2": -710.40521,
    "y2": -153.25702,
    "z2": 37.41512
  },
  {
    "name": "Ponsonbys на бульвар лас-лагунас",
    "category": 2,
    "subcategoty": 1,
    "price": 150000,
    "id": "a_f_y_business_01",
    "x": -165.27864,
    "y": -302.82574,
    "z": 39.73323,
    "heading": -107.9,
    "x2": -162.92903,
    "y2": -303.06699,
    "z2": 39.73327
  },
  {
    "name": "Парикмахерская на хавик-авеню",
    "category": 5,
    "price": 75000,
    "id": "a_f_y_hipster_02",
    "x": -34.9952,
    "y": -154.99937,
    "z": 57.07654,
    "heading": -30.81,
    "x2": -33.5399,
    "y2": -153.34576,
    "z2": 57.07653
  },
  {
    "name": "Suburban на хавик-авеню",
    "category": 2,
    "subcategoty": 0,
    "price": 80000,
    "id": "a_f_y_hipster_02",
    "x": 127.02856,
    "y": -225.3602,
    "z": 54.55788,
    "heading": 75.16,
    "x2": 124.81161,
    "y2": -224.65071,
    "z2": 54.55787
  },
  {
    "name": "Blazing tattoo на бульвар вайнвуд",
    "category": 4,
    "price": 80000,
    "id": "u_m_y_tattoo_01",
    "x": 321.26843,
    "y": 182.34993,
    "z": 103.58658,
    "heading": -143.5,
    "x2": 322.20331,
    "y2": 181.12799,
    "z2": 103.58659
  },
  {
    "name": "Herr kutz на бульвар миррор-парк",
    "category": 5,
    "price": 80000,
    "id": "a_f_y_hipster_02",
    "x": 1215.28882,
    "y": -474.80795,
    "z": 66.20802,
    "heading": 48.22,
    "x2": 1213.6488,
    "y2": -473.29398,
    "z2": 66.20809
  },
  {
    "name": "Binco на синнерс-пэсседж",
    "category": 2,
    "subcategoty": 2,
    "price": 75000,
    "id": "a_f_y_eastsa_03",
    "x": 427.21725,
    "y": -806.46167,
    "z": 29.49089,
    "heading": 89.64,
    "x2": 424.98358,
    "y2": -806.90967,
    "z2": 29.49113
  },
  {
    "name": "Discount на бульвар инносенс",
    "category": 2,
    "subcategoty": 3,
    "price": 75000,
    "id": "a_f_y_eastsa_03",
    "x": 73.71014,
    "y": -1392.83459,
    "z": 29.37614,
    "heading": -86.73,
    "x2": 75.89048,
    "y2": -1392.44104,
    "z2": 29.37614
  },
  {
    "name": "Herr kutz на карсон-авеню",
    "category": 5,
    "price": 75000,
    "id": "a_f_y_hipster_02",
    "x": 139.63506,
    "y": -1706.46228,
    "z": 29.29223,
    "heading": 108.04,
    "x2": 137.85893,
    "y2": -1707.09277,
    "z2": 29.29163
  },
  {
    "name": "Blazing tattoo на бульвар инносенс",
    "category": 4,
    "price": 75000,
    "id": "u_m_y_tattoo_01",
    "x": 1325.02393,
    "y": -1652.22632,
    "z": 52.2756,
    "heading": 86.96,
    "x2": 1323.10486,
    "y2": -1652.44214,
    "z2": 52.27531
  },
  {
    "name": "Тату на пляже",
    "category": 4,
    "price": 76666,
    "id": "u_m_y_tattoo_01",
    "x": -1280.02673,
    "y": -1118.18726,
    "z": 6.99023,
    "heading": 64.6,
    "x2": -1281.5498,
    "y2": -1117.53235,
    "z2": 6.99012
  },
  {
    "name": "Магазин оружия на бульвар морнингвуд",
    "category": 3,
    "price": 150000,
    "id": "s_m_y_ammucity_01",
    "x": -1303.55676,
    "y": -394.64349,
    "z": 36.69577,
    "heading": 74.42,
    "x2": -1305.92273,
    "y2": -394.3743,
    "z2": 36.69577
  },
  {
    "name": "Магазин еды на просперити-стрит",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": -1486.46851,
    "y": -377.18326,
    "z": 40.16364,
    "heading": 136.7,
    "x2": -1487.60974,
    "y2": -379.22137,
    "z2": 40.16343
  },
  {
    "name": "Магазин еды на сан-андреас-авеню",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": -1221.32214,
    "y": -908.27917,
    "z": 12.32646,
    "heading": 36.7,
    "x2": -1222.97888,
    "y2": -906.6261,
    "z2": 12.32646
  },
  {
    "name": "Магазин еды на паломино-авеню",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": -705.46631,
    "y": -914.73602,
    "z": 19.2156,
    "heading": 91.58,
    "x2": -707.95959,
    "y2": -914.54712,
    "z2": 19.21559
  },
  {
    "name": "Магазин оружия на паломина авеню ",
    "category": 3,
    "price": 150000,
    "id": "s_m_y_ammucity_01",
    "x": -662.72797,
    "y": -933.12903,
    "z": 21.82923,
    "heading": -179.76,
    "x2": -662.65143,
    "y2": -935.23364,
    "z2": 21.82921
  },
  {
    "name": "Магазин оружия на спэниш-авеню",
    "category": 3,
    "price": 150000,
    "id": "s_m_y_ammucity_01",
    "x": 254.12929,
    "y": -50.52563,
    "z": 69.94107,
    "heading": 68.41,
    "x2": 252.01332,
    "y2": -49.95927,
    "z2": 69.94106
  },
  {
    "name": "Магазин еды на клинтон-авеню",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": 372.91501,
    "y": 328.17792,
    "z": 103.56637,
    "heading": -108.71,
    "x2": 374.64496,
    "y2": 327.78418,
    "z2": 103.56638
  },
  {
    "name": "Хотдоги 10",
    "category": 0,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": 240.86362,
    "y": 167.12939,
    "z": 105.05949,
    "heading": 168.66,
    "x2": 240.0675,
    "y2": 164.70566,
    "z2": 105.05975
  },
  {
    "name": "Бургеры 7",
    "category": 1,
    "price": 50000,
    "id": "u_m_y_burgerdrug_01",
    "x": 245.74109,
    "y": 162.04276,
    "z": 104.95367,
    "heading": 5.19,
    "x2": 245.6611,
    "y2": 164.37573,
    "z2": 104.96863
  },
  {
    "name": "Магазин оружия на Элгин-авеню",
    "category": 3,
    "price": 150000,
    "id": "s_m_y_ammucity_01",
    "x": 23.02,
    "y": -1105.25586,
    "z": 29.797,
    "heading": 146.96,
    "x2": 21.9423,
    "y2": -1107.46277,
    "z2": 29.797
  },
  {
    "name": "Магазин еды на бульвар инносенс",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": 24.2172,
    "y": -1345.58594,
    "z": 29.49703,
    "heading": -89.89,
    "x2": 26.27586,
    "y2": -1345.5083,
    "z2": 29.49703
  },
  {
    "name": "Магазин еды на вест-миррор-драйв",
    "category": 7,
    "price": 70000,
    "id": "a_m_m_indian_01",
    "x": 1165.38428,
    "y": -323.56311,
    "z": 69.20511,
    "heading": 101.76,
    "x2": 1162.91174,
    "y2": -323.96542,
    "z2": 69.20505
  },
  {
    "name": "Магазин еды на бульвар эль-ранчо",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": 1133.88098,
    "y": -983.13928,
    "z": 46.41586,
    "heading": -80.95,
    "x2": 1136.01599,
    "y2": -982.21832,
    "z2": 46.41579
  },
  {
    "name": "Магазин оружия на шоссе олимпик",
    "category": 3,
    "price": 150000,
    "id": "s_m_y_ammucity_01",
    "x": 842.46069,
    "y": -1035.76245,
    "z": 28.19487,
    "heading": 2.78,
    "x2": 842.41205,
    "y2": -1033.5498,
    "z2": 28.19484
  },
  {
    "name": "Магазин оружия на попьюлар-стрит",
    "category": 3,
    "price": 150000,
    "id": "s_m_y_ammucity_01",
    "x": 810.14587,
    "y": -2159.36377,
    "z": 29.61901,
    "heading": -0.14,
    "x2": 810.17169,
    "y2": -2157.0144,
    "z2": 29.61899
  },
  {
    "name": "Магазин еды на шоссе паломино",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": 2555.44946,
    "y": 380.66788,
    "z": 108.62296,
    "heading": -3.76,
    "x2": 2555.44775,
    "y2": 382.59296,
    "z2": 108.62304
  },
  {
    "name": "Магазин еды на шоссе сенора",
    "category": 7,
    "price": 70000,
    "id": "a_m_m_indian_01",
    "x": 2676.47754,
    "y": 3280.1106,
    "z": 55.24113,
    "heading": -29.38,
    "x2": 2677.39429,
    "y2": 3281.93774,
    "z2": 55.24113
  },
  {
    "name": "Binco на грейпсид-мэйн-стрит",
    "category": 2,
    "subcategoty": 2,
    "price": 70000,
    "id": "a_f_y_eastsa_03",
    "x": 1695.5542,
    "y": 4823.01025,
    "z": 42.06311,
    "heading": 97.08,
    "x2": 1693.20728,
    "y2": 4822.64014,
    "z2": 42.06307
  },
  {
    "name": "Магазин еды на грейпсид-мэйн-стрит",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": 1697.00586,
    "y": 4922.98926,
    "z": 42.06369,
    "heading": -35.36,
    "x2": 1698.33069,
    "y2": 4925.08887,
    "z2": 42.06363
  },
  {
    "name": "Магазин еды на шоссе сенора",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": 1728.3429,
    "y": 6416.77832,
    "z": 35.03722,
    "heading": -116.26,
    "x2": 1730.28113,
    "y2": 6415.98193,
    "z2": 35.03728
  },
  {
    "name": "Магазин еды на бэнхэм-кэньон-драйв",
    "category": 7,
    "price": 70000,
    "id": "a_m_m_indian_01",
    "x": -1819.17432,
    "y": 793.7558,
    "z": 138.07632,
    "heading": 133.53,
    "x2": -1820.78748,
    "y2": 792.29376,
    "z2": 138.11194
  },
  {
    "name": "Магазин оружия на барбарено-роуд",
    "category": 3,
    "price": 150000,
    "id": "s_m_y_ammucity_01",
    "x": -3173.90942,
    "y": 1088.77368,
    "z": 20.83874,
    "heading": -114.41,
    "x2": -3171.59155,
    "y2": 1087.55884,
    "z2": 20.83875
  },
  {
    "name": "Тату на барбарено-роуд",
    "category": 4,
    "price": 75000,
    "id": "u_m_y_tattoo_01",
    "x": -3171.70166,
    "y": 1074.74292,
    "z": 20.82919,
    "heading": -70.22,
    "x2": -3170.2417,
    "y2": 1075.30762,
    "z2": 20.82918
  },
  {
    "name": "Suburban на шоссе-грейт-оушн",
    "category": 2,
    "subcategoty": 0,
    "price": 75000,
    "id": "a_f_y_hipster_02",
    "x": -3169.51074,
    "y": 1042.33228,
    "z": 20.86324,
    "heading": 67.58,
    "x2": -3171.55225,
    "y2": 1043.17419,
    "z2": 20.8632
  },
  {
    "name": "Магазин еды на барбарено-роуд",
    "category": 7,
    "price": 70000,
    "id": "a_m_m_indian_01",
    "x": -3244.00854,
    "y": 999.98566,
    "z": 12.83071,
    "heading": -5.93,
    "x2": -3243.83472,
    "y2": 1002.02747,
    "z2": 12.83071
  },
  {
    "name": "Магазин еды на шоссе грейт-оушн",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": -2965.69458,
    "y": 391.56979,
    "z": 15.04331,
    "heading": 89.43,
    "x2": -2968.17993,
    "y2": 391.22583,
    "z2": 15.0433
  },
  {
    "name": "Магазин еды на инесено-роуд",
    "category": 7,
    "price": 75000,
    "id": "a_m_m_indian_01",
    "x": -3040.4729,
    "y": 583.82361,
    "z": 7.90893,
    "heading": 19.47,
    "x2": -3041.17627,
    "y2": 585.74048,
    "z2": 7.90893
  },
  {
    "name": "Магазин оружия на шоссе 68",
    "category": 3,
    "price": 150000,
    "id": "s_m_y_ammucity_01",
    "x": -1119.32434,
    "y": 2699.93896,
    "z": 18.55415,
    "heading": -140.95,
    "x2": -1117.53479,
    "y2": 2698.15503,
    "z2": 18.55413
  },
  {
    "name": "Discount на шоссе 68",
    "category": 2,
    "subcategoty": 3,
    "price": 70000,
    "id": "a_f_y_eastsa_03",
    "x": -1102.56628,
    "y": 2711.86279,
    "z": 19.10786,
    "heading": -137.1,
    "x2": -1100.85669,
    "y2": 2710.20654,
    "z2": 19.10784
  },
  {
    "name": "Магазин оружия на шоссе грейт-оушн 2",
    "category": 3,
    "price": 150000,
    "id": "s_m_y_ammucity_01",
    "x": -331.93985,
    "y": 6085.22803,
    "z": 31.45476,
    "heading": -136.42,
    "x2": -330.17557,
    "y2": 6083.56201,
    "z2": 31.45476
  },
  {
    "name": "Тату на дулуоз-авеню",
    "category": 4,
    "price": 70000,
    "id": "u_m_y_tattoo_01",
    "x": -292.47104,
    "y": 6200.63721,
    "z": 31.48712,
    "heading": 98.34,
    "x2": -294.42795,
    "y2": 6199.9209,
    "z2": 31.48817
  },
  {
    "name": "Парикмахерская на дулуоз-авеню",
    "category": 5,
    "price": 70000,
    "id": "a_f_y_hipster_02",
    "x": -276.90265,
    "y": 6225.1123,
    "z": 31.69554,
    "heading": 17.06,
    "x2": -277.25842,
    "y2": 6227.07227,
    "z2": 31.69554
  },
  {
    "name": "Discount на бульвар палето",
    "category": 2,
    "subcategoty": 3,
    "price": 75000,
    "id": "a_f_y_eastsa_03",
    "x": 5.91101,
    "y": 6511.21289,
    "z": 31.87786,
    "heading": 42.82,
    "x2": 4.28964,
    "y2": 6512.58398,
    "z2": 31.87785
  },
  {
    "name": "Магазин еды на ниланд-авеню",
    "category": 7,
    "price": 75000,
    "id": "ig_mrk",
    "x": 1958.99536,
    "y": 3741.4126,
    "z": 32.34374,
    "heading": -61.59,
    "x2": 1960.6499,
    "y2": 3742.40381,
    "z2": 32.34373
  },
  {
    "name": "Парикмахерская ниланд-авеню",
    "category": 5,
    "price": 75000,
    "id": "a_f_y_hipster_02",
    "x": 1931.15308,
    "y": 3733.50757,
    "z": 32.84451,
    "heading": -176.48,
    "x2": 1931.27063,
    "y2": 3732.04761,
    "z2": 32.84447
  },
  {
    "name": "Тату на занкудо-авеню",
    "category": 4,
    "price": 75000,
    "id": "u_m_y_tattoo_01",
    "x": 1862.91846,
    "y": 3746.94678,
    "z": 33.03191,
    "heading": -33.32,
    "x2": 1863.55762,
    "y2": 3748.1123,
    "z2": 33.03189
  },
  {
    "name": "Магазин оружия на бульвар алгонквин",
    "category": 3,
    "price": 150000,
    "id": "s_m_y_ammucity_01",
    "x": 1691.95459,
    "y": 3761.14746,
    "z": 34.70534,
    "heading": -134.15,
    "x2": 1693.58765,
    "y2": 3759.69873,
    "z2": 34.70532
  },
  {
    "name": "Discounter на шоссе 68 (2)",
    "category": 2,
    "subcategoty": 3,
    "price": 75000,
    "id": "a_f_y_eastsa_03",
    "x": 1196.65686,
    "y": 2711.854,
    "z": 38.22266,
    "heading": -179.46,
    "x2": 1196.75781,
    "y2": 2709.87476,
    "z2": 38.22263
  },
  {
    "name": "Магазин еды на шоссе 68 (2)",
    "category": 7,
    "price": 75000,
    "id": "ig_mrk",
    "x": 1165.25134,
    "y": 2711.4978,
    "z": 38.15772,
    "heading": -178.08,
    "x2": 1165.51086,
    "y2": 2709.05591,
    "z2": 38.1577
  },
  {
    "name": "Suburban на шоссе 68",
    "category": 2,
    "subcategoty": 0,
    "price": 76666,
    "id": "a_f_y_eastsa_03",
    "x": 612.59418,
    "y": 2761.79907,
    "z": 42.08812,
    "heading": -84.37,
    "x2": 614.61615,
    "y2": 2762.00854,
    "z2": 42.08809
  },
  {
    "name": "Магазин еды на шоссе 68 (3)",
    "category": 7,
    "price": 80000,
    "id": "ig_mrk",
    "x": 549.58887,
    "y": 2669.66284,
    "z": 42.15649,
    "heading": 99.56,
    "x2": 547.88916,
    "y2": 2669.44067,
    "z2": 42.15652
  },
  {
    "name": "Магазин еды на дэвис авеню",
    "category": 7,
    "price": 80000,
    "id": "ig_mrk",
    "x": -47.12994,
    "y": -1758.82568,
    "z": 29.42101,
    "heading": 48.71,
    "x2": -48.80756,
    "y2": -1757.5592,
    "z2": 29.42099
  }
];

let saveFile = 'pricesAndCount';
var prices_and_count = {};
fs.readFile(`./data/pricesAndCount.json`, (err, data) => {
	if (err) {
		for(let i=0; i<businesses.length; i++){
			prices_and_count[i] = {id: i, price: businesses[i].price, name: businesses[i].name};
		}
		saveData();
	} else {
		prices_and_count = JSON.parse(data);
	}
});

function saveData(){
	fs.writeFile(`./data/pricesAndCount.json`, JSON.stringify(prices_and_count, undefined, 4), (err) => {
        if (err) console.log(`Couldn't save Shops data. Reason: ${err.message}`);
    });
};


saveFile = 'allBiz';
var playersBiz = {};
fs.readFile(`./data/allBiz.json`, (err, data) => {
	if (err) {
		playersBiz = {}
	} else {
		playersBiz = JSON.parse(data);
	}
});

function saveBizData(){
	fs.writeFile(`./data/allBiz.json`, JSON.stringify(playersBiz, undefined, 4), (err) => {
        if (err) console.log(`Couldn't save Biz data. Reason: ${err.message}`);
    });
};

mp.events.add({
	'getAllFreeBiz': (player) =>
	{
		player.call('phone:addBiz', [JSON.stringify(prices_and_count)]);
	},
	'biz:buy': (player, id) =>
	{
		if(prices_and_count[id] === undefined) return player.call('SendAlert', ['Ошибка', 'red']);
		if(player.data.cash < prices_and_count[id].price)
			return player.call('SendAlert', ['У вас недостаточно средств', 'red']);
		mp.events.call('buyThingsInTheShop', prices_and_count[id].price, 0);
		player.call('SendAlert', ['Вы успешно купили бизнес!', 'red']);
		if(Object.keys(playersBiz).indexOf(player.getVariable('sqlID')) === -1){
			playersBiz[player.getVariable('sqlID')] = [JSON.parse(JSON.stringify(businesses[id]))];
		} else {
			playersBiz[player.getVariable('sqlID')].push(JSON.parse(JSON.stringify(businesses[id])));
		}
		prices_and_count[id] = {}; 
		saveData()
		saveBizData()
		player.call('phone:addBiz', [JSON.stringify(prices_and_count)]);
	}
});
