const fs = require("fs");
const saveFile = "homes_data";
global.homesOwners = [];

let homesData = {
	0: [600000, 1],
	1: [1500000, 1],
	2: [2500000, 2],
	3: [4800000, 3],
	4: [7500000, 4],
	5: [12000000, 6],
	6: [15000000, 8],
	7: [19000000, 9],
	8: [21000000, 10],
	9: [37000000, 12]
};


var homes = require('../../configs/homes_data.json');
var allHomesBlips = [];

fs.readFile(`./data/${saveFile}.json`, (err, data) => {
	if (err) {
		homes.forEach((item, id) => {
			if(!item.type)
				global.homesOwners.push({owner: -1, close: false, parkingData: [], parkingLength: homesData[item.level][1]});
		});
		saveHomesData();
	} else {
	global.homesOwners = JSON.parse(data);
	}
	for(let i=0; i<global.homesOwners.length; i++){
		let item = global.homesOwners[i];
		if(item.owner === -1){
			allHomesBlips.push(mp.blips.new(40, new mp.Vector3(homes[i*2].x, homes[i*2].y, homes[i*2].z),
			{
				name: levels[parseInt(homes[i*2].level)],
				scale: 0.7,
				color: 2,
				shortRange: true,
				dimension: 0,
			}));		
		} else {
			allHomesBlips.push(mp.blips.new(40, new mp.Vector3(homes[i*2].x, homes[i*2].y, homes[i*2].z),
			{
				name: levels[parseInt(homes[i*2].level)],
				scale: 0.7,
				color: 1,
				shortRange: true,
				dimension: 0,
			}));
		}	
	}
});

function saveHomesData(){
	fs.writeFile(`./data/${saveFile}.json`, JSON.stringify(global.homesOwners, 4), (err) => {
        if (err) console.log(`Couldn't save homes_data. Reason: ${err.message}`);
    });
};



var SpawnHomesCar = [
	{x: -3081.3544921875, y: 223.22084045410156, z: 14.025300979614258, heading: -39.26437759399414, name: "спавн машины комфорт 1"},
	{x: -3097.82080078125, y: 300.6512145996094, z: 8.379875183105469, heading: -107.3145751953125, name: "спавн машины стандарт+ 1"},
	{x: -3096.4208984375, y: 307.33056640625, z: 8.325614929199219, heading: -105.20608520507812, name: "спавн машины стандарт+ 2"},
	{x: -3091.019775390625, y: 323.6751403808594, z: 7.498327255249023, heading: -108.4719467163086, name: "спавн машины комфорт 3"},
	{x: -3087.7529296875, y: 340.0932922363281, z: 7.383814811706543, heading: -104.99409484863281, name: "спавн машины премиум 1"},
	{x: -3080.222900390625, y: 362.8673095703125, z: 7.126247406005859, heading: -105.47537994384766, name: "спавн машины комфорт 4"},
	{x: -3078.091552734375, y: 371.54046630859375, z: 7.12723970413208, heading: -105.97384643554688, name: "спавн машины премиум 2"},
	{x: -3072.0185546875, y: 397.2955017089844, z: 6.968523025512695, heading: -106.49524688720703, name: "спавн машины премиум 3"},
	{x: -3055.19580078125, y: 438.9332580566406, z: 6.361703395843506, heading: -117.85127258300781, name: "спавн машины стандарт+ 4"},
	{x: -3050.74560546875, y: 447.2662048339844, z: 6.3617024421691895, heading: -117.180908203125, name: "спавн машины стандарт+ 3"},
	{x: -3037.607177734375, y: 479.287841796875, z: 6.784640312194824, heading: -103.7966079711914, name: "спавн машины стандарт+ 5"},
	{x: -3038.7861328125, y: 472.490234375, z: 6.6947503089904785, heading: -106.6613998413086, name: "спавн машины стандарт+ 6"},
	{x: -3031.61669921875, y: 498.8162841796875, z: 6.805952072143555, heading: -100.95474243164062, name: "спавн машины люкс 1"},
	{x: -3028.96484375, y: 520.1896362304688, z: 7.3354902267456055, heading: -96.0158462524414, name: "спавн машины стандарт+ 7"},
	{x: -3031.201171875, y: 548.9814453125, z: 7.502899646759033, heading: -90.56128692626953, name: "спавн машины комфорт 5"},
	{x: -3029.119873046875, y: 555.6066284179688, z: 7.50267219543457, heading: -87.4730453491211, name: "спавн машины комфорт 6"},
	{x: -3072.52783203125, y: 657.7978515625, z: 11.06960678100586, heading: -58.6131706237793, name: "спавн машины премиум 5"},
	{x: -3096.685791015625, y: 745.9876708984375, z: 21.17438316345215, heading: -136.95941162109375, name: "спавн машины комфорт 7"},
	{x: -3018.718505859375, y: 739.47314453125, z: 27.578161239624023, heading: 98.06212615966797, name: "спавн машины люкс+ 1"},
	{x: -2995.310546875, y: 704.419189453125, z: 28.475881576538086, heading: 110.08853149414062, name: "спавн машины люкс 2"},
	{x: -3002.08935546875, y: 686.9205322265625, z: 24.206144332885742, heading: 24.047454833984375, name: "спавн машины люкс 3"},
	{x: -2979.96337890625, y: 655.2498168945312, z: 25.65834617614746, heading: 105.14388275146484, name: "спавн машины люкс+ 2"},
	{x: -2597.45556640625, y: 1929.8343505859375, z: 167.30909729003906, heading: -85.85730743408203, name: "спавн машины вип 1"},
	{x: -3224.1220703125, y: 924.9263305664062, z: 13.96546745300293, heading: -55.765567779541016, name: "спавн машины стандарт+8"},
	{x: -3230.955322265625, y: 940.4179077148438, z: 13.701181411743164, heading: -69.0238037109375, name: "спавн машины комфорт 8"},
	{x: -3233.47900390625, y: 948.4430541992188, z: 13.292412757873535, heading: -74.15177917480469, name: "спавн машины стандарт+ 9"},
	{x: -3237.801025390625, y: 1031.1297607421875, z: 11.720260620117188, heading: -95.84396362304688, name: "спавн машины комфорт 10"},
	{x: -3236.635009765625, y: 1037.7281494140625, z: 11.647808074951172, heading: -95.9814682006836, name: "спавн машины комфорт 9"},
	{x: -3218.6845703125, y: 1108.5416259765625, z: 10.426239013671875, heading: -110.36843872070312, name: "спавн машины стандарт+ 11"},
	{x: -3219.68115234375, y: 1105.2218017578125, z: 10.444551467895508, heading: -109.90434265136719, name: "спавн машины стандарт+ 10"},
	{x: -3205.06591796875, y: 1135.4656982421875, z: 9.89735221862793, heading: -114.49372863769531, name: "спавн машины стандарт+ 12"},
	{x: -3203.466796875, y: 1139.0528564453125, z: 9.897348403930664, heading: -113.76607513427734, name: "спавн машины стандарт+ 13"},
	{x: -3200.609619140625, y: 1154.12548828125, z: 9.654343605041504, heading: -107.42916107177734, name: "спавн машины комфорт 10"},
	{x: -3197.44921875, y: 1159.6517333984375, z: 9.654424667358398, heading: -105.9566650390625, name: "спавн машины комфорт 11"},
	{x: -3188.258056640625, y: 1197.4241943359375, z: 9.43417739868164, heading: 174.41448974609375, name: "спавн машины стандарт+ 14"},
	{x: -3187.619384765625, y: 1202.995849609375, z: 9.507155418395996, heading: 171.6127166748047, name: "спавн машины стандарт+ 15"},
	{x: -3187.1005859375, y: 1223.0152587890625, z: 9.989912033081055, heading: -98.23319244384766, name: "спавн машины стандарт  1"},
	{x: -3186.688232421875, y: 1225.828857421875, z: 10.057071685791016, heading: -97.90087890625, name: "спавн машины стандарт 2"},
	{x: -3177.1630859375, y: 1296.5859375, z: 14.508476257324219, heading: -109.8298568725586, name: "спавн машины премиум 6"},
	{x: -3175.37109375, y: 1300.0203857421875, z: 14.546737670898438, heading: -116.23552703857422, name: "спавн машины премиум 7"},
	{x: -440.5553894042969, y: 6194.4716796875, z: 29.549423217773438, heading: 1.3525959253311157, name: "спавн машины стандарт 12"},
	{x: -439.89288330078125, y: 6200.29541015625, z: 29.548553466796875, heading: 7.156658172607422, name: "спавн машины стандарт 11"},
	{x: -380.4182434082031, y: 6185.6171875, z: 31.490596771240234, heading: -135.4124298095703, name: "спавн машины стандарт+ 16"},
	{x: -369.7163391113281, y: 6202.3779296875, z: 31.481964111328125, heading: -138.25428771972656, name: "спавн машины стандарт 13"},
	{x: -355.31414794921875, y: 6223.7109375, z: 31.489294052124023, heading: -136.65574645996094, name: "спавн машины стандарт 14"},
	{x: -359.2391052246094, y: 6255.09130859375, z: 31.487642288208008, heading: -44.44391632080078, name: "спавн машины комфорт 12"},
	{x: -393.1995849609375, y: 6308.47705078125, z: 29.259502410888672, heading: -141.0446014404297, name: "спавн машины комфорт 13"},
	{x: -293.74578857421875, y: 6337.32470703125, z: 32.39494323730469, heading: 45.81412124633789, name: "спавн машины комфорт 14"},
	{x: -254.65414428710938, y: 6359.45068359375, z: 31.480924606323242, heading: 44.20983123779297, name: "спавн машины стандарт+ 18"},
	{x: -217.74183654785156, y: 6380.501953125, z: 31.59811782836914, heading: 40.74344253540039, name: "спавн машины стандарт+ 17"},
	{x: -197.7828369140625, y: 6397.4384765625, z: 31.86250877380371, heading: 45.60212326049805, name: "спавн машины комфорт 15"},
	{x: -180.6841583251953, y: 6411.0517578125, z: 31.86250877380371, heading: 44.673927307128906, name: "спавн машины стандарт 15"},
	{x: -227.18295288085938, y: 6437.78564453125, z: 31.1997127532959, heading: -132.73670959472656, name: "спавн машины комфорт 16"},
	{x: -233.5802459716797, y: 6420.41455078125, z: 31.240711212158203, heading: -136.34060668945312, name: "спавн машины стандарт+ 19"},
	{x: -265.521240234375, y: 6407.9970703125, z: 30.986955642700195, heading: -144.16148376464844, name: "спавн машины стандарт+ 18"},
	{x: -105.84501647949219, y: 6535.662109375, z: 29.809165954589844, heading: 48.58150863647461, name: "спавн машины стандарт+ 20"},
	{x: -35.25963592529297, y: 6588.1875, z: 30.971786499023438, heading: 45.493263244628906, name: "спавн машины стандарт 16"},
	{x: -16.72981071472168, y: 6647.25634765625, z: 31.133493423461914, heading: -149.8853302001953, name: "спавн машины стандарт+ 21"},
	{x: 20.54597282409668, y: 6663.69287109375, z: 31.537311553955078, heading: -173.95529174804688, name: "спавн машины стандарт+ 22"},
	{x: 1732.7818603515625, y: 3860.552490234375, z: 34.71904754638672, heading: -144.83758544921875, name: "спавн машины стандарт 10"},
	{x: 1905.011962890625, y: 3777.39697265625, z: 32.78544235229492, heading: 31.409961700439453, name: "спавн машины стандарт 6"},
	{x: 1889.8702392578125, y: 3816.428466796875, z: 32.435916900634766, heading: 29.146778106689453, name: "спавн машины стандарт 5"},
	{x: 1869.147216796875, y: 3925.158935546875, z: 32.98179244995117, heading: 11.843451499938965, name: "спавн машины стандарт 9"},
	{x: 496.3471374511719, y: 2621.358154296875, z: 42.62643051147461, heading: -80.57463836669922, name: "спавн машины стандарт 4"},
	{x: 496.63739013671875, y: 2622.15283203125, z: 42.61588668823242, heading: -79.25110626220703, name: "спавн машины стандарт 4"},
	{x: 464.0850524902344, y: 2601.378173828125, z: 43.273155212402344, heading: 3.902264356613159, name: "спавн машины стандарт 3"},
	{x: 1049.189453125, y: -378.33831787109375, z: 67.85344696044922, heading: -139.02206420898438, name: "спавн машины стандарт+ 23"},
	{x: 1020.2131958007812, y: -416.060546875, z: 65.94414520263672, heading: -141.77798461914062, name: "спавн машины стандарт+ 24"},
	{x: 1010.4288330078125, y: -417.0207214355469, z: 64.95402526855469, heading: -142.52854919433594, name: "спавн машины стандарт+ 25"},
	{x: 991.4520874023438, y: -436.6329650878906, z: 63.75755310058594, heading: -68.83473205566406, name: "спавн машины комфорт 18"},
	{x: 975.103759765625, y: -452.71051025390625, z: 62.403072357177734, heading: -143.7890625, name: "спавн машины стандарт+ 26"},
	{x: 941.537353515625, y: -468.02581787109375, z: 61.2523193359375, heading: -146.49916076660156, name: "спавн машины стандарт+ 27"},
	{x: 932.1254272460938, y: -477.88848876953125, z: 60.7049674987793, heading: -157.46556091308594, name: "спавн машины комфорт 19"},
	{x: 911.45068359375, y: -483.9260559082031, z: 59.03834915161133, heading: -156.77227783203125, name: "спавн машины премиум 8"},
	{x: 869.7090454101562, y: -502.50286865234375, z: 57.497657775878906, heading: -130.64541625976562, name: "спавн машины стандарт 17"},
	{x: 838.8031005859375, y: -541.423583984375, z: 57.32569885253906, heading: -93.71255493164062, name: "спавн машины комфорт 20"},
	{x: 847.6666870117188, y: -566.8516845703125, z: 57.70792007446289, heading: -80.85538482666016, name: "спавн машины стандарт+ 28"},
	{x: 869.3026733398438, y: -593.2501220703125, z: 58.29447937011719, heading: 138.3066864013672, name: "гараж комфорт 21 фикс"},
	{x: 871.410400390625, y: -590.6987915039062, z: 58.08526611328125, heading: -43.55010223388672, name: "спавн машины комфорт 21"},
	{x: 874.8958129882812, y: -598.394287109375, z: 58.19483184814453, heading: -41.1436767578125, name: "спавн машины стандрат+ 29"},
	{x: 915.5291748046875, y: -627.5203857421875, z: 58.04898452758789, heading: -39.86025619506836, name: "спавн машины премиум 9"},
	{x: 916.2011108398438, y: -641.3504028320312, z: 57.863182067871094, heading: -41.899986267089844, name: "спавн машины комфорт 22"},
	{x: 949.7926025390625, y: -654.6807250976562, z: 57.995052337646484, heading: -53.771671295166016, name: "спавн машины стандарт+ 30"},
	{x: 944.5114135742188, y: -670.0225830078125, z: 58.011474609375, heading: -63.053585052490234, name: "спавн машины премиум 10"},
	{x: 971.8909912109375, y: -686.5425415039062, z: 57.80561065673828, heading: -53.914913177490234, name: "спавн машины комфорт 23"},
	{x: 979.1884155273438, y: -711.6721801757812, z: 57.72071075439453, heading: -49.50886917114258, name: "спавн машины комфорт 24"},
	{x: 1006.8475952148438, y: -731.9284057617188, z: 57.63225555419922, heading: -47.64101791381836, name: "спавн машины стандарт+ 31"},
	{x: 976.3453369140625, y: -617.569580078125, z: 58.8409423828125, heading: 124.63590240478516, name: "спавн машины премиум 11"},
	{x: 959.365234375, y: -605.7581176757812, z: 59.380306243896484, heading: 29.862977981567383, name: "спавн машины комфорт 25"},
	{x: 986.0090942382812, y: -578.2605590820312, z: 59.27328872680664, heading: 31.524559020996094, name: "спавн машины стандарт 18"},
	{x: 1006.4345092773438, y: -562.5750732421875, z: 60.19947814941406, heading: -96.05022430419922, name: "спавн машины стандарт+ 32"},
	{x: 1007.0459594726562, y: -589.1364135742188, z: 59.09451675415039, heading: -102.83404541015625, name: "спавн машины стандарт+ 33"},
	{x: 1257.496826171875, y: -420.6396484375, z: 69.4316635131836, heading: -58.66472244262695, name: "спавн машины стандарт 19"},
	{x: 1262.6470947265625, y: -443.6119689941406, z: 69.83647155761719, heading: -80.87830352783203, name: "спавн машины  комфорт 26"},
	{x: 1257.2513427734375, y: -491.51776123046875, z: 69.40235137939453, heading: -106.1514663696289, name: "спавн машины комфорт 28"},
	{x: 1245.2073974609375, y: -522.1658935546875, z: 68.97227478027344, heading: -103.52159118652344, name: "спавн машины стандарт 20"},
	{x: 1313.036865234375, y: -521.14208984375, z: 71.31228637695312, heading: 157.8961181640625, name: "спавн машины премиум 12"},
	{x: 1319.7349853515625, y: -530.0722045898438, z: 72.12126159667969, heading: 159.97021484375, name: "спавн машины премиум 13"},
	{x: 1358.8302001953125, y: -541.0590209960938, z: 73.77381134033203, heading: 155.74752807617188, name: "спавн машины премиум 14"},
	{x: 1364.841552734375, y: -548.7613525390625, z: 74.3378677368164, heading: 157.99351501464844, name: "спавн машины премиум 15"},
	{x: 1401.508056640625, y: -571.9352416992188, z: 74.33888244628906, heading: 112.2886734008789, name: "спавн машины премиум 16"},
	{x: 1389.4969482421875, y: -605.3718872070312, z: 74.33796691894531, heading: 49.933692932128906, name: "спавн машины премиум 17"},
	{x: 1359.972412109375, y: -616.2356567382812, z: 74.33795928955078, heading: -1.861690878868103, name: "спавн машины премиум 18"},
	{x: 1346.4210205078125, y: -606.8259887695312, z: 74.35601043701172, heading: -39.41908264160156, name: "спавн машины премиум 19"},
	{x: 1312.4781494140625, y: -589.8969116210938, z: 72.9319839477539, heading: -25.055030822753906, name: "спавн машины премиум 20"},
	{x: 1291.2222900390625, y: -581.64111328125, z: 71.74278259277344, heading: -18.92437744140625, name: "спавн машины премиум 21"},
	{x: 1241.839111328125, y: -578.124267578125, z: 69.44358825683594, heading: -91.21446228027344, name: "спавн машины стандарт+ 34"},
	{x: 1238.6180419921875, y: -586.5740356445312, z: 69.26817321777344, heading: -87.67931365966797, name: "спавн машины стандарт+ 35"},
	{x: 1254.496337890625, y: -625.2551879882812, z: 69.35148620605469, heading: -62.79001998901367, name: "спавн машины комфорт 29"},
	{x: 1269.6219482421875, y: -659.571533203125, z: 67.74771881103516, heading: -63.706756591796875, name: "спавн машины комфорт 30"},
	{x: 1272.6273193359375, y: -672.6393432617188, z: 65.85313415527344, heading: -84.36188507080078, name: "спавн машины комфорт 31"},
	{x: 1257.690673828125, y: -712.1267700195312, z: 64.50648498535156, heading: -122.11407470703125, name: "спавн машины стандарт 21"},
	{x: 1224.39453125, y: -726.7905883789062, z: 60.56526565551758, heading: 158.5664825439453, name: "спавн машины стандарт+ 36"},
	{x: 1223.88720703125, y: -703.853515625, z: 60.699729919433594, heading: 95.56976318359375, name: "спавн машины стандарт 22"},
	{x: 1215.8165283203125, y: -665.141845703125, z: 62.78541564941406, heading: 102.72602844238281, name: "спавн машины комфорт 32"},
	{x: 1204.131591796875, y: -613.6163940429688, z: 65.97249603271484, heading: 1.9312769174575806, name: "спавн машины стандарт 23"},
	{x: 1189.9971923828125, y: -596.8570556640625, z: 64.00970458984375, heading: 96.26305389404297, name: "спавн машины стандарт+ 37"},
	{x: 1187.50634765625, y: -573.6819458007812, z: 64.33735656738281, heading: 93.74203491210938, name: "спавн машины комфорт 33"},
	{x: 1187.488037109375, y: -554.4542846679688, z: 64.55089569091797, heading: 89.41619873046875, name: "спавн машины стандарт+ 38"},
	{x: 392.30780029296875, y: 432.04736328125, z: 143.0734405517578, heading: -96.46275329589844, name: "спавн машины люкс+ 5"},
	{x: 353.4675598144531, y: 437.0265197753906, z: 146.8345184326172, heading: -54.73423767089844, name: "спавн машины люкс+ 6"},
	{x: 328.2174072265625, y: 482.35662841796875, z: 151.0389862060547, heading: 10.27928352355957, name: "спавн машины люкс++ 1"},
	{x: 318.8487854003906, y: 494.3069152832031, z: 152.70018005371094, heading: -76.6441421508789, name: "спавн машины люкс++ 2"},
	{x: 238.0999298095703, y: 528.177001953125, z: 140.53375244140625, heading: 113.13092041015625, name: "спавн машины люкс+++ 1"},
	{x: 175.00099182128906, y: 471.8614501953125, z: 141.90740966796875, heading: -10.799839973449707, name: "спавн машины люкс++ 3"},
	{x: 107.76899719238281, y: 497.1553955078125, z: 147.14810180664062, heading: -166.32350158691406, name: "спавн машины люкс++ 4"},
	{x: 97.28406524658203, y: 475.197021484375, z: 147.31385803222656, heading: -66.6689453125, name: "спавн машины люкс++ 5"},
	{x: 89.07825469970703, y: 487.28216552734375, z: 147.7720489501953, heading: -153.4434051513672, name: "спавн машины люкс++ 6"},
	{x: 64.35725402832031, y: 456.2152099609375, z: 146.80641174316406, heading: 15.527573585510254, name: "спавн машины люкс+++ 2"},
	{x: 55.92972946166992, y: 468.05841064453125, z: 146.7952117919922, heading: -168.36322021484375, name: "спавн машины люкс++ 7"},
	{x: 1.1872599124908447, y: 467.92626953125, z: 145.8826904296875, heading: 69.40853118896484, name: "спавн машины люкс+++ 3"},
	{x: -73.1788558959961, y: 495.8005065917969, z: 144.4453125, heading: -17.27999496459961, name: "спавн машины люкс++ 8"},
	{x: -122.79293060302734, y: 508.8282775878906, z: 143.05006408691406, heading: -6.009910583496094, name: "спавн машины люкс++ 9"},
	{x: -187.8861083984375, y: 502.1470642089844, z: 134.5631103515625, heading: 107.00027465820312, name: "спавн машины люкс++ 10"},
	{x: -245.0401153564453, y: 492.9389953613281, z: 125.97857666015625, heading: 82.71832275390625, name: "спавн машины люкс++ 11"},
	{x: -316.1365051269531, y: 480.74310302734375, z: 112.92259216308594, heading: 123.46135711669922, name: "спавн машины люкс++ 12"},
	{x: -321.7630615234375, y: 430.2099609375, z: 109.87303161621094, heading: 9.895400047302246, name: "спавн машины люкс++ 13"},
	{x: -346.0007019042969, y: 428.35076904296875, z: 110.56642150878906, heading: 21.056612014770508, name: "спавн машины люкс+++ 4"},
	{x: -450.3331604003906, y: 373.4745178222656, z: 104.7748031616211, heading: 84.00174713134766, name: "спавн машины люкс++ 14"},
	{x: -489.3571472167969, y: 409.8756408691406, z: 99.1500015258789, heading: 163.4824676513672, name: "спавн машины премиум 39"},
	{x: -513.2286376953125, y: 426.5373840332031, z: 97.2754898071289, heading: 43.43634033203125, name: "спавн машины люкс 8"},
	{x: -514.9269409179688, y: 389.7726745605469, z: 93.74929809570312, heading: 58.900474548339844, name: "спавн машины люкс+++ 5"},
	{x: -538.1030883789062, y: 485.82647705078125, z: 102.94525909423828, heading: 46.96003341674805, name: "спавн машины люкс+ 7"},
	{x: -575.3331298828125, y: 496.1251525878906, z: 106.64667510986328, heading: 8.039009094238281, name: "спавн машины люкс+++ 6"},
	{x: -614.5780029296875, y: 491.953125, z: 108.6336669921875, heading: 10.032905578613281, name: "спавн машины люкс+ 8"},
	{x: -634.465087890625, y: 527.3051147460938, z: 109.68775939941406, heading: -169.7440643310547, name: "спавн машины люкс++ 15"},
	{x: -690.5114135742188, y: 510.60504150390625, z: 110.36429595947266, heading: -162.38153076171875, name: "спавн машины люкс+ 9"},
	{x: -715.59228515625, y: 496.15277099609375, z: 109.2790756225586, heading: -153.5064239501953, name: "спавн машины люкс+++ 8"},
	{x: -737.8369140625, y: 444.197021484375, z: 106.85953521728516, heading: 6.446195602416992, name: "спавн машины люкс+++ 7"},
	{x: -755.1539306640625, y: 439.1418762207031, z: 99.87548065185547, heading: 17.91680145263672, name: "спавн машины люкс 9"},
	{x: -766.8651123046875, y: 467.1423034667969, z: 100.32868194580078, heading: -132.23251342773438, name: "спавн машины люкс+++ 9"},
	{x: -807.6636962890625, y: 423.99639892578125, z: 91.55818939208984, heading: -17.89305877685547, name: "спавн машины люкс++ 16"},
	{x: -845.1732177734375, y: 459.840576171875, z: 87.76853942871094, heading: 97.11674499511719, name: "спавн машины люкс+ 10"},
	{x: -863.0864868164062, y: 462.94793701171875, z: 88.04521942138672, heading: -76.9019775390625, name: "спавн машины люкс+++ 10"},
	{x: -845.2771606445312, y: 521.0503540039062, z: 90.62232208251953, heading: 109.32647705078125, name: "спавн машины люкс++ 16"},
	{x: -873.2348022460938, y: 542.7898559570312, z: 92.5065689086914, heading: -175.0668182373047, name: "спавн машины люкс ++ 19"},
	{x: -910.9306640625, y: 552.8330688476562, z: 95.91279602050781, heading: -42.8797492980957, name: "спавн машины люкс++ 18"},
	{x: -912.091064453125, y: 586.927734375, z: 100.97557830810547, heading: 143.61801147460938, name: "спавн машины люкс++ 20"},
	{x: -932.8189697265625, y: 569.4375, z: 99.9348373413086, heading: -27.238000869750977, name: "спавн машины премиум 40"},
	{x: -955.1675415039062, y: 579.2264404296875, z: 101.05323791503906, heading: -75.89356994628906, name: "спавн машины люкс 10"},
	{x: -946.0342407226562, y: 594.9111938476562, z: 101.00485229492188, heading: 159.9759521484375, name: "спавн машины люкс+++ 11"},
	{x: -986.3085327148438, y: 586.4699096679688, z: 102.31818389892578, heading: -17.67532730102539, name: "спавн машины премиум 41"},
	{x: -1037.0101318359375, y: 590.1734008789062, z: 103.23716735839844, heading: 14.100911140441895, name: "спавн машины люкс+++ 12"},
	{x: -1094.0001220703125, y: 597.6517944335938, z: 103.06453704833984, heading: -151.74171447753906, name: "спавн машины люкс++ 21"},
	{x: -1107.481201171875, y: 552.709716796875, z: 102.57627868652344, heading: 38.62922668457031, name: "спавн машины люкс 11"},
	{x: -1133.509033203125, y: 549.6770629882812, z: 102.27870178222656, heading: 18.432466506958008, name: "спавн машины люкс+ 11"},
	{x: -1235.779541015625, y: 488.8038635253906, z: 93.25440216064453, heading: 108.93114471435547, name: "спавн машины люкс+++ 13"},
	{x: -1322.8052978515625, y: 449.5201110839844, z: 99.71350860595703, heading: -0.24595509469509125, name: "спавн машины люкс++ 22"},
	{x: -1417.6368408203125, y: 466.27264404296875, z: 109.41789245605469, heading: -24.327369689941406, name: "спавн машины люкс 12"},
	{x: -1454.1396484375, y: 533.8087768554688, z: 119.18586730957031, heading: -124.79551696777344, name: "спавн машины люкс++ 23"},
	{x: -1496.725341796875, y: 418.4595642089844, z: 111.10775756835938, heading: 43.31602096557617, name: "спавн машины люкс++ 24"},
	{x: -1548.02734375, y: 427.6867370605469, z: 109.3794937133789, heading: -90.4065933227539, name: "спавн машины люкс++ 25"},
	{x: -1186.369384765625, y: -973.2728881835938, z: 4.829600811004639, heading: 118.87770080566406, name: "спавн машины люкс 6"},
	{x: -1081.8975830078125, y: -920.4586791992188, z: 3.486048936843872, heading: 34.22891616821289, name: "спавн машины люкс 5"},
	{x: -1052.4818115234375, y: -905.7581176757812, z: 4.3115692138671875, heading: 36.16550827026367, name: "спавн машины премиум 31"},
	{x: -1038.8909912109375, y: -902.4495239257812, z: 4.079630374908447, heading: -38.095542907714844, name: "спавн машины премиум 30"},
	{x: -1022.0285034179688, y: -891.90234375, z: 5.59241247177124, heading: 35.74151611328125, name: "спавн машины комфорт 39"},
	{x: -993.1530151367188, y: -908.7638549804688, z: 2.1492888927459717, heading: -59.799190521240234, name: "спавн машины премиум 29"},
	{x: -982.2432250976562, y: -902.0216674804688, z: 2.1501829624176025, heading: -61.466495513916016, name: "спавн машины люкс 4"},
	{x: -972.1715698242188, y: -896.5510864257812, z: 2.150413751602173, heading: -61.466495513916016, name: "спавн машины премиум 28"},
	{x: -950.4435424804688, y: -899.8645629882812, z: 2.1630630493164062, heading: -61.95923614501953, name: "спавн машины премиум 27"},
	{x: -943.1237182617188, y: -910.9125366210938, z: 2.163402795791626, heading: -58.91682434082031, name: "спавн машины премиум 26"},
	{x: -939.1926879882812, y: -928.116455078125, z: 2.145312786102295, heading: -58.120426177978516, name: "спавн машины комфорт 38"},
	{x: -926.9031372070312, y: -937.283203125, z: 2.243417263031006, heading: -151.1802215576172, name: "спавн машины премиум 25"},
	{x: -922.204345703125, y: -950.9874267578125, z: 2.1629369258880615, heading: -58.85380935668945, name: "спавн машины премиум 24"},
	{x: -908.1123657226562, y: -967.7777099609375, z: 2.164057493209839, heading: -151.8448486328125, name: "спавн машины премиум 23"},
	{x: -897.7598876953125, y: -985.1742553710938, z: 2.1630284786224365, heading: -149.51290893554688, name: "спавн машины премиум 22"},
	{x: -893.068359375, y: -1007.37060546875, z: 2.1503260135650635, heading: -148.77952575683594, name: "спавн машины комфорт 37"},
	{x: -872.9501953125, y: -1074.902099609375, z: 2.1578757762908936, heading: 28.579545974731445, name: "спавн машины комфорт 35"},
	{x: -864.7379150390625, y: -1090.5579833984375, z: 2.1628780364990234, heading: -61.54670715332031, name: "спавн машины комфорт 36"},
	{x: -985.0674438476562, y: -985.1227416992188, z: 1.9941294193267822, heading: 117.67449188232422, name: "спавн машины комфорт 43"},
	{x: -1008.7495727539062, y: -1009.275146484375, z: 2.150299072265625, heading: 29.943193435668945, name: "спавн машины комфорт 42"},
	{x: -1020.2193603515625, y: -1003.2960205078125, z: 2.135593891143799, heading: 118.86622619628906, name: "спавн машины премиум 35"},
	{x: -1021.40771484375, y: -1015.5780029296875, z: 2.1503584384918213, heading: 31.845413208007812, name: "спавн машины комфорт 41"},
	{x: -1041.00927734375, y: -1005.4866943359375, z: 2.1501924991607666, heading: -149.3696746826172, name: "спавн машины премиум 33"},
	{x: -1038.6849365234375, y: -1019.976318359375, z: 2.1435317993164062, heading: 119.5079345703125, name: "спавн машины премиум 34"},
	{x: -1075.8583984375, y: -1036.453369140625, z: 2.1551589965820312, heading: -61.243038177490234, name: "спавн машины премиум 32"},
	{x: -1075.15234375, y: -1048.078857421875, z: 2.1502997875213623, heading: 28.613927841186523, name: "спавн машины комфорт 40"},
	{x: -1027.2740478515625, y: -1129.4173583984375, z: 2.1586976051330566, heading: -59.272064208984375, name: "спавн машины люкс+ 3"},
	{x: -1022.552001953125, y: -1135.89501953125, z: 2.158597230911255, heading: -58.39543533325195, name: "спавн машины комфорт 44"},
	{x: -1037.306884765625, y: -1141.7525634765625, z: 2.0798795223236084, heading: -61.220115661621094, name: "спавн машины премиум 36"},
	{x: -1044.9912109375, y: -1140.11962890625, z: 2.158600330352783, heading: -60.6930046081543, name: "спавн машины люкс 7"},
	{x: -1044.6463623046875, y: -1152.744873046875, z: 2.1585984230041504, heading: 30.745330810546875, name: "спавн машины комфорт 45"},
	{x: -1062.4044189453125, y: -1155.9200439453125, z: 2.0886881351470947, heading: -59.98826599121094, name: "спавн машины премиум 37"},
	{x: -1074.151611328125, y: -1163.4395751953125, z: 2.158600091934204, heading: -53.71438217163086, name: "спавн машины премиум 38"},
	{x: -1077.0498046875, y: -1160.55029296875, z: 2.1169662475585938, heading: -59.650211334228516, name: "спавн машины люкс+ 4"},
	{x: 242.50828552246094, y: -2054.90869140625, z: 18.037933349609375, heading: -43.88814163208008, name: "спавн машины стандарт 39"},
	{x: 265.579833984375, y: -2029.8785400390625, z: 18.613346099853516, heading: -41.73383331298828, name: "спавн машины стандарт 40"},
	{x: 280.9034729003906, y: -2003.1070556640625, z: 20.20632553100586, heading: -133.68209838867188, name: "спавн машины стандарт 41"},
	{x: 284.6243591308594, y: -1984.419677734375, z: 21.148853302001953, heading: -130.2099609375, name: "спавн машины стандарт 42"},
	{x: 305.6708984375, y: -1981.1302490234375, z: 22.135196685791016, heading: -46.21435546875, name: "спавн машины стандарт 43"},
	{x: 311.93572998046875, y: -1967.81982421875, z: 23.504749298095703, heading: -134.53005981445312, name: "спавн машины стандарт 44"},
	{x: 311.7547302246094, y: -1939.4451904296875, z: 24.63964080810547, heading: -129.74014282226562, name: "спавн машины стандарт 46"},
	{x: 271.8857421875, y: -1891.7757568359375, z: 26.702674865722656, heading: 144.79258728027344, name: "спавн машины стандарт 47"},
	{x: 259.43548583984375, y: -1906.8714599609375, z: 25.848588943481445, heading: 137.7451934814453, name: "спавн машины стандарт 48"},
	{x: 248.3231964111328, y: -1920.072021484375, z: 24.932846069335938, heading: 131.465576171875, name: "спавн машины стандарт 49"},
	{x: 246.0198516845703, y: -1937.367431640625, z: 24.34299659729004, heading: 6.131064414978027, name: "спавн машины стандарт 50"},
	{x: 187.4132537841797, y: -1876.1082763671875, z: 24.626739501953125, heading: 154.2406463623047, name: "спавн машины стандарт 51"},
	{x: 166.8845672607422, y: -1861.503662109375, z: 24.14145851135254, heading: 152.6077117919922, name: "спавн машины стандарт 52"},
	{x: 139.23794555664062, y: -1868.003173828125, z: 24.243295669555664, heading: 159.8269805908203, name: "спавн машины стандарт 53"},
	{x: 126.9690933227539, y: -1857.93017578125, z: 24.798425674438477, heading: 137.4930877685547, name: "спавн машины стандарт 54"},
	{x: 140.3707275390625, y: -1831.8983154296875, z: 27.049013137817383, heading: 52.12812423706055, name: "спавн машины стандарт 56"},
	{x: 312.4176940917969, y: -1858.1092529296875, z: 27.188627243041992, heading: -40.11808395385742, name: "спавн машины стандарт 32"},
	{x: 336.26934814453125, y: -1836.703857421875, z: 27.31450843811035, heading: 45.22970199584961, name: "спавн машины стандарт+ 43"},
	{x: 348.3948974609375, y: -1809.56689453125, z: 28.495956420898438, heading: 49.566993713378906, name: "спавн машины стандарт 31"},
	{x: 356.3686828613281, y: -1896.413818359375, z: 24.80064582824707, heading: -133.9628448486328, name: "спавн машины стандарт 33"},
	{x: 385.98779296875, y: -1892.9202880859375, z: 25.133222579956055, heading: -134.11753845214844, name: "спавн машины стандарт 34"},
	{x: 396.91864013671875, y: -1875.0299072265625, z: 26.20485496520996, heading: -136.04840087890625, name: "спавн машины стандарт 35"},
	{x: 396.749755859375, y: -1851.3660888671875, z: 26.813749313354492, heading: -135.03427124023438, name: "спавн машины стандарт 36"},
	{x: 428.4061584472656, y: -1853.540771484375, z: 27.475143432617188, heading: -131.28138732910156, name: "спавн машины стандарт 37"},
	{x: 432.7987976074219, y: -1832.652099609375, z: 27.978925704956055, heading: -137.37767028808594, name: "спавн машины стандарт 38"},
	{x: 477.884521484375, y: -1778.46142578125, z: 28.66805648803711, heading: -65.37979888916016, name: "спавн машины стандарт+ 41"},
	{x: 486.16455078125, y: -1758.912109375, z: 28.561782836914062, heading: 170.24908447265625, name: "спавн машины стандарт 28"},
	{x: 467.0906982421875, y: -1741.19384765625, z: 29.00822639465332, heading: -116.88297271728516, name: "спавн машины стандарт 27"},
	{x: 483.9264221191406, y: -1719.919677734375, z: 29.403533935546875, heading: -110.63772583007812, name: "спавн машины стандарт 26"},
	{x: 496.6435546875, y: -1702.6905517578125, z: 29.400569915771484, heading: -117.89710235595703, name: "спавн машины стандарт 25"},
	{x: 440.7187194824219, y: -1696.67041015625, z: 29.28697395324707, heading: 45.52763366699219, name: "спавн машины стандарт+ 42"},
	{x: 420.6356201171875, y: -1715.5986328125, z: 29.306074142456055, heading: 147.03857421875, name: "спавн машины стандарт 31"},
	{x: 432.0805358886719, y: -1736.017578125, z: 29.246931076049805, heading: 45.854225158691406, name: "спавн машины стандарт 30"},
	{x: 403.5713806152344, y: -1740.4578857421875, z: 29.30436134338379, heading: 50.02535629272461, name: "спавн машины стандарт 29"}
];


let homesSpawn = {
	1: new mp.Vector3(266.0701599121094, -1007.1035766601562, -100.96748352050781),
	2: new mp.Vector3(266.0701599121094, -1007.1035766601562, -100.96748352050781),
	3: new mp.Vector3(346.4884948730469, -1012.4173583984375, -99.19617462158203),
	4: new mp.Vector3(-30.801589965820312, -595.3533325195312, 80.03089141845703), 
	5: new mp.Vector3(-18.28391456604004, -581.9730834960938, 90.11479187011719),
	6: new mp.Vector3(-18.28391456604004, -581.9730834960938, 90.11479187011719),
	7: new mp.Vector3(-174.22140502929688, 497.56689453125, 137.65786743164062),
	8: new mp.Vector3(373.6195373535156, 423.54620361328125, 145.90785217285156),
}
let levels = {
	1: 'Стандарт',
	2: 'Стандарт+',
	3: 'Комфорт',
	4: 'Премиум',
	5: 'Люкс',
	6: 'Люкс+',
	7: 'Люкс++',
	8: 'Люкс+++',
	9: 'Вип'
}

let i = 0;
homes.forEach((item, id) => {
	
	mp.labels.new(item.name, new mp.Vector3(item.x, item.y, item.z + 0.5), 
	{
		dismension: 0,
		los: true,
		font: 0,
		drawDistance: 10,
	});

	mp.markers.new(1, new mp.Vector3(item.x, item.y, item.z - 2), 1.5, 
	{
		color: [273,60,100, 125],
		dimension: 0,
	});
	
	homeCol = mp.colshapes.newSphere(item.x, item.y, item.z, 1.5, 0);
	if(item.type)
		homeCol.setVariables({
			'callBack': 'garage:open',
			'params': [i],
			'client': 0,
		});
	else{
		homeCol.setVariables({
			'callBack': 'home:open',
			'params': [parseInt(i/2)],
			'client': 0,
		});
		if(homesSpawn[item.level] !== undefined)
		{
			mp.labels.new('Выйти', new mp.Vector3(homesSpawn[item.level].x, homesSpawn[item.level].y, homesSpawn[item.level].z + 0.5), 
			{
				dimension: parseInt(i/2),
				los: true,
				font: 0,
				drawDistance: 10,
			});

			mp.markers.new(1, new mp.Vector3(homesSpawn[item.level].x, homesSpawn[item.level].y, homesSpawn[item.level].z - 2), 1.5, 
			{
				color: [273,60,100, 125],
				dimension: parseInt(i/2),
			});
			homeCol = mp.colshapes.newSphere(homesSpawn[item.level].x, homesSpawn[item.level].y, homesSpawn[item.level].z, 1.5, parseInt(i/2));
			homeCol.setVariables({
				'callBack': 'home:exit',
				'params': [parseInt(i/2)],
				'client': 0,
			});
		}
	}
	i++;
});

mp.events.add({
	'home:open': (player, params) =>
	{
		let [smth] = JSON.parse(params);
		let semiHomeData = homes[parseInt(smth)*2];
		let data = {};
		data.id = parseInt(smth);
		let sss = semiHomeData.name.split(' ')
		data.houseId = sss[sss.length - 1];
		data.price = homesData[parseInt(semiHomeData.level)][0];
		data.type = semiHomeData.level;
		data.owner = global.homesOwners[String(smth)].owner;
		data.close = global.homesOwners[String(smth)].close;
		player.call('homeInteraction:open', [JSON.stringify(data)]);
	},
	'home:exit': (player, params) =>
	{
		let [heedHome] = JSON.parse(params); 
		needHome = homes[parseInt(heedHome) * 2];
		player.sspawn(new mp.Vector3(needHome.x, needHome.y, needHome.z));
		player.dimension = 0;
	},
	'garage:open': (player, params) =>
	{
		return player.call('SendAlert', ['На доработке', 'red']);
	},
	'home:spawnInHome': (player, home) =>
	{
		if(global.homesOwners[parseInt(home)].close)
			return player.call('SendAlert', ['Дом закрыт', 'red']);
		let needHome = homes[parseInt(home)*2];
		player.dimension = parseInt(home);
		player.sspawn(homesSpawn[parseInt(needHome.level)]);
		player.call('homeInteraction:close');
	},
	'home:knockTheDoor': (player, home) =>
	{
		let owner = global.homesOwners[String(home)].owner;
		let needPlayer = false
		mp.players.forEach((_player) => {
				if(_player.getVariable('sqlID') === parseInt(owner))
					needPlayer = _player; 
			});
		player.call('SendAlert', ['Вы постучали', 'green']);
		if(!needPlayer)
			return
		needPlayer.call('SendAlert', ['К Вам стучатся в квартиру', 'green']);
	},
	'home:buyHouse': (player, home, type) =>
	{
		let money = [player.data.cash, player.data.card];
		let semiHomeData = homes[parseInt(home)*2];
		if(global.homesOwners[parseInt(home)].owner != -1) return player.call('SendAlert', ['Произошла ошибка', 'red']);
		if(money[type] >= homesData[parseInt(semiHomeData.level)][0]){
			global.homesOwners[parseInt(home)].owner = player.getVariable('sqlID');
			player.call('SendAlert', ['Вы успешно купили новые апартаменты', 'green']);
			let smth = JSON.parse(JSON.stringify(player.data.inventory));
			let semiProduct = JSON.parse(JSON.stringify(global.playerItems['69']));
			semiProduct.description = "Ключи от " + semiHomeData.name;
			semiProduct.entity = home;
			
			for(let i=0; i < player.data.inventory['inventory-box'].length; i++){
				if(Object.keys(player.data.inventory['inventory-box'][i]).length) continue;
				if(semiProduct.count === semiProduct.maxCount){
					smth['inventory-box'][i] = Object.assign({}, semiProduct);
					semiProduct.count = 0;
					player.call('updateInventory', ['inventory-box', i, 69, semiProduct.description, 0]);
					break;
				}
			}
			if(semiProduct.count)
				mp.events.call("putItemOnTheGround", player, JSON.stringify(semiProduct));
			mp.events.call('buyThingsInTheShop', player, homesData[parseInt(semiHomeData.level)][0], type);
			player.data.inventory = JSON.parse(JSON.stringify(smth));
			player.customCharacter.Inventory = JSON.parse(JSON.stringify(player.data.inventory));
			for(let i=0; i<allHomesBlips.length; i++){
				let item = global.homesOwners[i];
				allHomesBlips[i].destroy();
				if(item.owner === -1){
					allHomesBlips[i] = mp.blips.new(40, new mp.Vector3(homes[i*2].x, homes[i*2].y, homes[i*2].z),
					{
						name: levels[parseInt(homes[i*2].level)],
						scale: 0.7,
						color: 2,
						shortRange: true,
						dimension: 0,
					});		
				} else {
					allHomesBlips[i] = mp.blips.new(40, new mp.Vector3(homes[i*2].x, homes[i*2].y, homes[i*2].z),
					{
						name: levels[parseInt(homes[i*2].level)],
						scale: 0.7,
						color: 1,
						shortRange: true,
						dimension: 0,
					});
				}
				
			}
		} else {
			return player.call('SendAlert', ['У Вас недостаточно средств', 'red']);
		}
		saveHomesData();
		
	},
	'home:openOrClose': (player, home) =>
	{
		let keys = false;
		let smth = JSON.parse(JSON.stringify(player.data.inventory));
		for(box in player.data.inventory)
			if(box !== 'information')
				for(let each=0; each<player.data.inventory[box].length; each++)
					if(player.data.inventory[box][each].entity === home)
						keys = true;
		if(!keys)
			return player.call('SendAlert', ['У вас нет ключей!', 'red']);
		global.homesOwners[parseInt(home)].close = !global.homesOwners[parseInt(home)].close;
		player.call('homeInteraction:semiUpdate', [global.homesOwners[parseInt(home)].close]);
		saveHomesData();
	},
	'home:openByKeys': (player, home) =>
	{
		if(player.dist(new mp.Vector3(homes[parseInt(home)*2].x, homes[parseInt(home)*2].y, homes[parseInt(home)*2].z)) > 5)
			return player.call('SendAlert', ['Вы далеко от дома', 'red']);
		else{
			global.homesOwners[parseInt(home)].close = !global.homesOwners[parseInt(home)].close;
			player.call('SendAlert', [`Дом ${(global.homesOwners[parseInt(home)].close ? 'закрыт': 'открыт')}`, 'green']);
		}
		saveHomesData();
	},
});